In [1]:
# let us import the Pandas Library
import pandas as pd

In [17]:
#Define a dictionary 'x'

x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}

#casting the dictionary to a DataFrame
df = pd.DataFrame(x)

#display the result df
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [3]:
#Retrieving the "ID" column and assigning it to a variable x
x = df[['ID']]
x

   ID
0   1
1   2
2   3
3   4

Let's use the <code>type()</code> function and check the type of the variable.

In [4]:
#check the type of x
type(x)

pandas.core.frame.DataFrame

In [5]:
#Retrieving the Department, Salary and ID columns and assigning it to a variable z

z = df[['Department','Salary','ID']]
z

        Department  Salary  ID
0  Architect Group  100000   1
1   Software Group   80000   2
2      Design Team   50000   3
3   Infrastructure   60000   4

### Try it yourself

In [6]:
#write your code here

# Create the DataFrame
data = {
    "Student": ["David", "Samuel", "Terry", "Evan"],
    "Age": [27, 24, 22, 32],
    "Country": ["UK", "Canada", "China", "USA"],
    "Course": ["Python", "Data Structures", "Machine Learning", "Web Development"],
    "Marks": [85, 72, 89, 76]
}

df = pd.DataFrame(data)

# Display the DataFrame
df

  Student  Age Country            Course  Marks
0   David   27      UK            Python     85
1  Samuel   24  Canada   Data Structures     72
2   Terry   22   China  Machine Learning     89
3    Evan   32     USA   Web Development     76

##### Problem 2: Retrieve the Marks column and assign it to a variable b

In [7]:
#write your code here
b = df[["Marks"]]

##### Problem 3: Retrieve the Country and Course columns and assign it to a variable c

In [10]:
#write your code here

c = df[["Country", "Course"]]
c

  Country            Course
0      UK            Python
1  Canada   Data Structures
2   China  Machine Learning
3     USA   Web Development

In [12]:
# Get the Student column as a series Object

x = df['Student']
x

0     David
1    Samuel
2     Terry
3      Evan
Name: Student, dtype: object

In [13]:
#check the type of x
type(x)

pandas.core.series.Series

In [14]:
# Access the value on the first row and the first column

df.iloc[0, 0]

'David'

In [15]:
# Access the value on the first row and the third column

df.iloc[0,2]

'UK'

In [18]:
# Access the column using the name

df.loc[0, 'Salary']

np.int64(100000)

In [27]:
df2=df
df2=df2.set_index("Name")

In [20]:
#To display the first 5 rows of new dataframe
df2.head()

      ID       Department  Salary
Name
Rose   1  Architect Group  100000
John   2   Software Group   80000
Jane   3      Design Team   50000
Mary   4   Infrastructure   60000

In [21]:
#Now, let us access the column using the name
df2.loc['Jane', 'Salary']

np.int64(50000)

### Try it yourself

In [29]:
print("hello")
df2

hello

      ID       Department  Salary
Name
Rose   1  Architect Group  100000
John   2   Software Group   80000
Jane   3      Design Team   50000
Mary   4   Infrastructure   60000

In [30]:
#write your code here

df2.loc["Jane", "Department"]

'Design Team'

In [31]:
#write your code here

df2.iloc[3,2]

np.int64(60000)

In [32]:
# let us do the slicing using old dataframe df

df.iloc[0:2, 0:3]

   Name  ID       Department
0  Rose   1  Architect Group
1  John   2   Software Group

In [33]:
#let us do the slicing using loc() function on old dataframe df where index column is having labels as 0,1,2
df.loc[0:2,'ID':'Department']

   ID       Department
0   1  Architect Group
1   2   Software Group
2   3      Design Team

In [34]:
#let us do the slicing using loc() function on new dataframe df2 where index column is Name having labels: Rose, John and Jane
df2.loc['Rose':'Jane', 'ID':'Department']

      ID       Department
Name
Rose   1  Architect Group
John   2   Software Group
Jane   3      Design Team

<h2 id="quiz">Try it yourself</h2>

In [36]:
# Write your code below and press Shift+Enter to execute

df.loc[1:2, "Name":"Department"]

   Name  ID      Department
1  John   2  Software Group
2  Jane   3     Design Team